a = 1
b = 0
while a != 0:
    a = int(input())
    b += a
print(b)


'''Напишите программу, которая считывает со стандартного ввода целые числа, по одному числу в строке, и после первого
 введенного нуля выводит сумму полученных на вход чисел.

'''